<?xml version="1.0" ?>
<net name="mbv3s-backbone-3-class-2-view-6-batch-concat-no-batchnorm-bs32-1-c" version="10">
	<layers>
		<layer id="0" name="input_image" type="Parameter" version="opset1">
			<data shape="1, 3, 224, 224" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="input_image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="features.0.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="0" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="features.0.0.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="71">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1728" size="4"/>
			<output>
				<port id="0" precision="FP32" names="72">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="73">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Clip_5" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="76">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_6" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1732" size="4"/>
			<output>
				<port id="0" precision="FP32" names="77">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Div_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="78">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Mul_8" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="79">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="128548120" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1, 1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="1285">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="1285" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1, 1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="1285">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_23" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="95"/>
			</output>
		</layer>
		<layer id="12" name="Shape_19" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="91">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_20" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1744" size="4"/>
			<output>
				<port id="0" precision="I32" names="92"/>
			</output>
		</layer>
		<layer id="14" name="Gather_21/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="Gather_211597" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="93,94"/>
			</output>
		</layer>
		<layer id="16" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64" names="96"/>
			</output>
		</layer>
		<layer id="17" name="Range_25" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="97">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Slice_30/Concat1311147781" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Slice_30/Concat131011311246695" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1756" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Slice_30/Strides1311347856" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Slice_30" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="102">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_45" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1764" size="24"/>
			<output>
				<port id="0" precision="I64" names="119">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_46" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_46/EltwiseUnsqueeze_input_port_1/value2106946977" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_46/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="120">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Add_49" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="123">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_35" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="107"/>
			</output>
		</layer>
		<layer id="28" name="Shape_31" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="103">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_32" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1788" size="4"/>
			<output>
				<port id="0" precision="I32" names="104"/>
			</output>
		</layer>
		<layer id="30" name="Gather_33/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="31" name="Gather_331573" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="105,106"/>
			</output>
		</layer>
		<layer id="32" name="Constant_36" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64" names="108"/>
			</output>
		</layer>
		<layer id="33" name="Range_37" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="109">
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_47" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1792" size="16"/>
			<output>
				<port id="0" precision="I64" names="121">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_48" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="I64">
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_48/EltwiseUnsqueeze_input_port_1/value2107347154" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1808" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Reshape_48/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>112</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="122">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Add_50" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="124">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_42" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="114"/>
			</output>
		</layer>
		<layer id="40" name="Shape_38" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="110">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_39" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1824" size="4"/>
			<output>
				<port id="0" precision="I32" names="111"/>
			</output>
		</layer>
		<layer id="42" name="Gather_40/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="43" name="Gather_401587" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="112,113"/>
			</output>
		</layer>
		<layer id="44" name="Constant_43" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64" names="115"/>
			</output>
		</layer>
		<layer id="45" name="Range_44" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Range_44/EltwiseUnsqueeze_input_port_1/value2107748108" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1828" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Range_44/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="116">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Add_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="125">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Shape_52" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="126,165">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="ConstantOfShape_54/Broadcast/FillValue" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Shape_53" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="127">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="ConstantOfShape_54/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="128">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Mul_56/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="130">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Equal_57" type="Equal" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="131">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Where_58" type="Select" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="132">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Expand_59" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="133">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Unsqueeze_60/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1756" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Unsqueeze_60/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="134">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="ConstantOfShape_62/Broadcast/FillValue" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Shape_61" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="135">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="ConstantOfShape_62/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="136">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Mul_64/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="138">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Equal_65" type="Equal" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="139">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Where_66" type="Select" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="140">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Expand_67" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="141">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Unsqueeze_68/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1756" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Unsqueeze_68/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="142">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="ConstantOfShape_70/Broadcast/FillValue" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Shape_69" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="143">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="ConstantOfShape_70/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="144">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Mul_72/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="146">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Equal_73" type="Equal" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="147">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Where_74" type="Select" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="148">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Expand_75" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="I64">
					<dim>112</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="149">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Unsqueeze_76/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1756" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Unsqueeze_76/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="150">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="ConstantOfShape_78/Broadcast/FillValue" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Shape_77" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="151">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="ConstantOfShape_78/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="152">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Mul_80/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="154">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Equal_81" type="Equal" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="155">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Where_82" type="Select" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="BOOL">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="156">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Expand_83" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="I64">
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="157">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Unsqueeze_84/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1756" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Unsqueeze_84/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="158">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Concat_85" type="Concat" version="opset1">
			<data axis="4"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="159">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_16" type="Const" version="opset1">
			<data element_type="f32" shape="4, 112, 112" offset="1852" size="200704"/>
			<output>
				<port id="0" precision="FP32" names="87">
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_9" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="202556" size="4"/>
			<output>
				<port id="0" precision="I32" names="80"/>
			</output>
		</layer>
		<layer id="89" name="Gather_10/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="90" name="Gather_101601" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="81">
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Slice_15/Concat1307547421" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="202560" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Slice_15/Concat130611307647637" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="202584" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Slice_15/Strides1307747739" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="202608" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Slice_15" type="StridedSlice" version="opset1">
			<data begin_mask="0, 1, 1" end_mask="0, 1, 1" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0" ellipsis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="86">
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Shape_17" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="88">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Expand_18" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="89">
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_92" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="166">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="ScatterND_93" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="167">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="features.1.block.0.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="202632" size="576"/>
			<output>
				<port id="0" precision="FP32" names="features.1.block.0.0.weight">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_94" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="168">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_95" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="169">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1381" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="203208" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="103" name="GlobalAveragePool_96/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="GlobalAveragePool_96/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="GlobalAveragePool_96/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="GlobalAveragePool_96/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="107" name="1383" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="108" name="GlobalAveragePool_96/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="GlobalAveragePool_96/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="170">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="features.1.block.1.fc1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 1, 1" offset="203216" size="512"/>
			<output>
				<port id="0" precision="FP32" names="features.1.block.1.fc1.weight">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_97/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_97/Dims12321" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="203728" size="32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_97" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="171">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Relu_98" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="172">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="features.1.block.1.fc2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 1, 1" offset="203760" size="512"/>
			<output>
				<port id="0" precision="FP32" names="features.1.block.1.fc2.weight">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_99/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_99/Dims12345" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="204272" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_99" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="173">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="HardSigmoid_100/HardSigmoid__input_port_1/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1732" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="HardSigmoid_100/HardSigmoid__input_port_2/value" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="204336" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="HardSigmoid_100/HardSigmoid_" type="HardSigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32"/>
				<port id="2" precision="FP32"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="174">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Mul_101" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="175">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="features.1.block.2.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 1" offset="204340" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="features.1.block.2.0.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_102" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="176">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="128747091" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1, 1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="1287">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="1287" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1, 1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="1287">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_117" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64" names="192"/>
			</output>
		</layer>
		<layer id="128" name="Shape_113" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="188">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_114" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1744" size="4"/>
			<output>
				<port id="0" precision="I32" names="189"/>
			</output>
		</layer>
		<layer id="130" name="Gather_115/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="131" name="Gather_1151621" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="190,191"/>
			</output>
		</layer>
		<layer id="132" name="Constant_118" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64" names="193"/>
			</output>
		</layer>
		<layer id="133" name="Range_119" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="194">
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Slice_124/Concat1322747670" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Slice_124/Concat132171322847796" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1756" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Slice_124/Strides1322947208" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1748" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Slice_124" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="199">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Constant_139" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1764" size="24"/>
			<output>
				<port id="0" precision="I64" names="216">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Reshape_140" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Reshape_140/EltwiseUnsqueeze_input_port_1/value2109746803" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1736" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Reshape_140/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="217">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
